Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/industrial_relations_and_trade_unions/joint_labour_committees.html.txt.tmx
Source language: en
Languages: ga

source: • Joint Labour Committees before July 2011
ga: • Comhchoistí Oibreachais roimh 7 Iúil 2011

source: Joint Labour Committees regulate conditions of employment and set minimum rates of pay for employees in certain sectors, by means of Employment Regulation Orders (EROs)
ga: Rialaíonn na Comhchoistí Oibreachais ná coinníollacha oibre agus íosrátaí pá d' fhostaithe in earnálacha áirithe trí Orduithe Rialaithe Fostaíochta

source: A Joint Labour Committee (JLC) is established by a statutory order of the Labour Court under the Industrial Relations Act 1946
ga: Bunaítear Comhchoiste Oibreachais trí ordú reachtúil ón gCúirt Oibreachais faoin Acht Caidrimh Thionscail 1946

source: It is an independent body made up of equal numbers of employer and worker representatives appointed by the Labour Court, with a chair appointed by the Minister for Jobs, Enterprise and Innovation
ga: Is comhlachas neamhspleách é ina bhfuil an méid céanna fostóirí agus ionadaithe na n-oibrithe atá ceaptha ag an gCúirt Oibreachais, agus ceapann An tAire Post, Fiontar agus Nuálaíochta an Cathaoirleach

source: Any of the following can apply to the Labour Court to set up a JLC:
ga: Baineann seo leanas leis an gCúirt Oibreachais chun Comhchoiste Oibreachais a bhunú:

source: • The Minister for Jobs, Enterprise and Innovation
ga: • An tAire Post, Fiontar agus Nuálaíochta

source: • An organisation claiming to represent the workers or employers involved
ga: • Eagraíocht a dhéanann ionadaíocht ar son oibrithe agus fostóirí atá bainteach leis an gcás

source: The Industrial Relations (Amendment) Act 2012, which reformed reforming the Joint Labour Committees’ wage-setting mechanisms, came into force on 1 August 2012
ga: An 1 Lúnasa 2012 tháinig an tAcht Caidrimh Thionscail (Leasú) 2012 (pdf) a d'athchóirigh na meicníochtaí cinneadh pá na Comhchoistí Oibreachais i bhfeidhm

source: The Act provides for the Labour Court to adopt an Employment Regulation Order drawn up by a JLC
ga: Faoin Acht, uchtaíonn an Chúirt Oibreachais Ordú Rialaithe Fostaíochta (ORF) dréachtaithe ag Comhchoiste Oibreachais

source: The ERO is then given statutory effect by the Minister for Jobs, Enterprise and Innovation
ga: Tugann an tAire Post, Fiontar agus Nuálaíochta éifeacht reachtúil don ORF

source: The Act's provisions include:
ga: Cuimsíonn forálacha na reachtaíochta:

source: • JLCs have the power to set a basic adult wage rate and 2 additional higher rates
ga: • Tá cumhacht ag na CCO leag síos bunráta do dhuine fásta agus 2 ráta fhorlíontach níos airde

source: • Companies may seek exemption from paying ERO rates due to financial difficulty
ga: • Tá cead ag cuideachtaí díolúine a chuardaigh ón ghá rátaí ORF agus CFC a íoc de bharr deacracht airgeadais

source: • JLCs no longer set Sunday premium rates
ga: • Ní leagann CCO síos rátaí préimh Domhnach níos mó

source: A new statutory Code of Practice on Sunday working is to be prepared by the Workplace Relations Commission
ga: Beidh an Coimisiún um Chaidreamh Oibreachais ag ullmhú Cód Cleachtais nua maidir le hobair Domhnachomh

source: • When setting wage rates JLCs will have to take into account factors such as competitiveness and rates of employment and unemployment
ga: • Nuair leagann CCO rátaí síos, caithfidh siad go gcuirtear critéir nua san áireamh ar nós tosca iomaíochais agus rátaí fostaíochta agus dífhostaíochta

source: There are new EROs for the contract cleaning and security industries – see below
ga: Tá ORF nua le haghaidh tionscail glanadh ar chonradh agus slándála i bhfeidhm – féach thíos

source: List of Joint Labour Committees
ga: Liosta de na Comhchoistí Oibreachais

source: • Catering (excluding Dublin City and Dun Laoghaire)
ga: • Lónadóireacht (Baile Átha Cliath agus Dún Laoghaire)

source: • Hotels (Others excluding Cork)
ga: • Óstáin (Eile, ach ní Corcaigh)

source: • Retail, Grocery and Allied Trades
ga: • Miondíoltóireacht, Grósaeireacht & Comhcheardaithe

source: Information and Customer Service
ga: Seirbhíse Faisnéise agus Custaiméara

source: Opening Hours: Mon. to Fri. 9.30am to 5pm
ga: Uaireanta Oscailte:Luan go hAoine 9.30rn go 5in

source: Tel: (059) 917 8990
ga: Teil: (059) 917 8990

source: Locall: 1890 80 80 90
ga: Lóghlao: 1890 80 80 90

source: Joint Labour Committees before July 2011
ga: Comhchoistí Oibreachais roimh 7 Iúil 2011

source: Previously some employments were covered by agreements made by Joint Labour Committees
ga: Roimhe sin bhí roinnt fostaíochtaí clúdaithe i gcomhaontuithe a raibh déanta ag Comhchoistí Oibreachais

source: Following a High Court decision Employment Regulation Orders ceased to have statutory effect from 7 July 2011
ga: Ag leanúint ó chinneadh na hArd-Chúirte, stad Orduithe Rialaithe Fostaíochta d’aon tionchar reachtúla ón 7 Iúil 2011

source: Employees who were covered by an ERO have existing contracts of employment which govern their pay and conditions of work
ga: Tá conarthaí fostaíochta reatha ag fostaithe a bhí clúdaithe ag ORF a rialaíonn a bpá agus a gcoinníollacha oibre

source: If an employer reduces an employee’s rate of pay this would be a change in their contract of employment and normally such changes require the employee’s consent
ga: Má laghdaíonn fostóir ráta pá an fhostaí is athrú ar a gconradh fostaíochta a bheadh anseo agus de ghnáth teastaíonn cead an fhostaí chun é seo a dhéanamh
